Tekla Open API Reference for Tekla Structures 2025
BoltItem Methods
The BoltItem type exposes the following members.
Methods
Name | Description
ExportBoltStandard
 Exports the bolt item standard + needed bolt catalog items in *.bass-format to the to given file name. If path is not given bolt standard + items are exported to model folder. If filename is empty bolt standard name is used as filename.
Top
See Also
Reference
BoltItem Class
Tekla.Structures.Catalogs Namespace